{
  "definitions": {
    "Transaction": {
      "description": "A spending transaction related to the contracting process. Draws upon the data models of the [Fiscal Data Package](http://fiscal.dataprotocols.org/) and the [International Aid Transpareny Initiative](http://iatistandard.org/activity-standard/iati-activities/iati-activity/transaction/) and should be used to cross-reference to more detailed information held using a Fiscal Data Package, IATI file, or to provide enough information to allow a user to manually or automatically cross-reference with some other published source of transactional spending data.",
      "properties": {
        "value": {
          "title": "Value",
          "description": "The value of the transaction.",
          "$ref": "#/definitions/Value"
        },
        "payer": {
          "title": "Payer",
          "description": "The Organization Identifier for the organization from which the funds in this transaction originate. Expressed following the Organizational Identifier standard - consult the documentation and the codelist.",
          "$ref": "#/definitions/Identifier"
        },
        "payee": {
          "title": "Payee",
          "description": "The Organization Identifier for the organization which receives the funds in this transaction. Expressed following the Organizational Identifier standard - consult the documentation and the codelist.",
          "$ref": "#/definitions/Identifier"
        },
        "id": {
          "description": "A unique identifier for this transaction. This identifier should be possible to cross-reference against the provided data source. For IATI this is the transaction reference."
        },
        "source": {
          "description": "Used to point either to a corresponding Fiscal Data Package, IATI file, or machine or human-readable source where users can find further information on the budget line item identifiers, or project identifiers, provided here."
        },
        "amount": {
          "deprecated": {
            "deprecatedVersion": "1.1",
            "description": "This field has been replaced by the ```transaction.value``` field for consistency with the use of value and amount elsewhere in the standard."
          }
        },
        "providerOrganization": {
          "deprecated": {
            "deprecatedVersion": "1.1",
            "description": "This field has been replaced by the ```transaction.payer``` field to resolve ambiguity arising from 'provider' being interpreted as relating to the goods or services procured rather than the flow of funds between the parties."
          }
        },
        "receiverOrganization": {
          "deprecated": {
            "deprecatedVersion": "1.1",
            "description": "This field has been replaced by the ```transaction.payee``` field to resolve ambiguity arising from 'receiver' being interpreted as relating to the goods or services procured rather than the flow of funds between the parties."
          }
        }
      }
    }
  }
}